In [8]:
#Inicio teste para linhas duplicadas

import pandas as pd

df_dia = pd.read_csv("f_diarias.csv")

In [9]:
df_dia.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
21925    False
21926    False
21927    False
21928    False
21929    False
Length: 21930, dtype: bool

In [10]:
df_dia[df_dia.duplicated()]

Empty DataFrame
Columns: [hotel_id, data_id, tipo_quarto, quartos_vendidos, adr_estimado, receita_diarias]
Index: []

In [11]:
import pandas as pd

df_inv = pd.read_csv("f_inventario_diario.csv")

In [12]:
df_inv.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
21925    False
21926    False
21927    False
21928    False
21929    False
Length: 21930, dtype: bool

In [13]:
df_inv[df_inv.duplicated()]

Empty DataFrame
Columns: [hotel_id, data_id, tipo_quarto, quartos_total, quartos_manutencao, quartos_disponiveis]
Index: []

In [14]:
import pandas as pd

df_pag = pd.read_csv("f_pagamentos.csv")

In [15]:
df_pag.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
31564    False
31565    False
31566    False
31567    False
31568    False
Length: 31569, dtype: bool

In [16]:
df_pag[df_pag.duplicated()]

Empty DataFrame
Columns: [pagamento_id, reserva_id, data_pagamento_id, forma_pagamento, valor_pago, status_pagamento, taxa_gateway]
Index: []

In [17]:
import pandas as pd

df_res = pd.read_csv("f_reservas.csv")

In [18]:
df_res.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
32075     True
32076     True
32077     True
32078     True
32079     True
Length: 32080, dtype: bool

In [19]:
df_res[df_res.duplicated()]

,reserva_id,data_reserva_id,data_cancelamento_id,motivo_cancelamento_id,checkin_id,checkout_id,hotel_id,hospede_id,canal_id,agencia_id,rate_plan_id,tipo_quarto,status,adultos,criancas,valor_previsto,desconto,moeda
32000,23101,20250315,20250319.0,2.0,20250324,20250328,1,9305,5,NaN,1,Suite,Cancelada,1,0,2656.00,0.00,BRL
32001,17363,20251120,NaN,NaN,20251231,20260105,4,768,3,1.0,1,Superior,Finalizada,1,1,2964.46,425.54,BRL
32002,8994,20250906,NaN,NaN,20251019,20251020,6,5222,1,NaN,4,Familia,Finalizada,2,1,439.49,0.00,BRL
32003,19567,20240607,NaN,NaN,20240608,20240612,4,11354,2,NaN,4,Standard,Finalizada,1,2,1321.46,0.00,EUR
32004,3799,20240110,NaN,NaN,20240119,20240120,4,5513,4,2.0,1,Standard,Finalizada,2,0,383.08,0.00,BRL
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32075,2684,20240118,NaN,NaN,20240124,20240125,2,4916,5,NaN,4,Deluxe,Finalizada,2,2,487.25,0.00,BRL
32076,21255,20240724,NaN,NaN,20240801,20240803,1,5722,1,NaN,1,Deluxe,Finalizada,1,2,1128.11,0.00,BRL
32077,25301,20240529,NaN,NaN,20240610,20240611,5,2094,1,NaN,1,Standard,Finalizada,1,2,225.91,16.67,BRL
32078,10869,20250228,20250305.0,3.0,20250309,20250312,2,11906,5,NaN,1,Standard,Cancelada,2,0,782.05,0.00,BRL
32079,15432,20240523,20240524.0,5.0,20240527,20240531,6,8623,5,NaN,3,Familia,Cancelada,1,1,1291.48,0.00,BRL

In [1]:
import pandas as pd

df_rev = pd.read_csv("f_reviews.csv")

In [2]:
df_rev.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
10767    False
10768    False
10769    False
10770    False
10771    False
Length: 10772, dtype: bool

In [3]:
df_rev[df_rev.duplicated()]

Empty DataFrame
Columns: [review_id, reserva_id, data_review_id, nota, limpeza, localizacao, atendimento, comentario_flag]
Index: []

In [5]:
import pandas as pd

df_ag = pd.read_csv("d_agencia.csv")

In [8]:
df_ag.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [9]:
import pandas as pd

df_can = pd.read_csv("d_canal.csv")

In [10]:
df_can.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [11]:
import pandas as pd

df_dt = pd.read_csv("d_data.csv")

In [12]:
df_dt.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
726    False
727    False
728    False
729    False
730    False
Length: 731, dtype: bool

In [13]:
df_dt[df_dt.duplicated()]

Empty DataFrame
Columns: [data_id, data, ano, mes, nome_mes, trimestre, dia_semana, fim_de_semana_flag, feriado_flag, alta_temporada_flag]
Index: []

In [14]:
import pandas as pd

df_hos = pd.read_csv("d_hospede.csv")

In [15]:
df_hos.duplicated()

0        False
1        False
2        False
3        False
4        False
         ...
11995    False
11996    False
11997    False
11998    False
11999    False
Length: 12000, dtype: bool

In [16]:
df_hos[df_hos.duplicated()]

Empty DataFrame
Columns: [hospede_id, pais, uf, cidade, faixa_etaria, segmento]
Index: []

In [20]:
import pandas as pd

df_htl = pd.read_csv("d_hotel.csv")

In [21]:
df_htl.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [19]:
import pandas as pd

df_mc = pd.read_csv("d_motivo_cancelamento.csv")

In [22]:
df_mc.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [23]:
import pandas as pd

df_pt = pd.read_csv("d_plano_tarifario.csv")

In [24]:
df_pt.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [25]:
import pandas as pd

df_tq = pd.read_csv("d_tipo_quarto.csv")

In [26]:
df_tq.duplicated()

#Fim do teste de linhas duplicatas

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [52]:
#Inicio de overbooking

import pandas as pd

# Lendo os CSVs
df_dia = pd.read_csv('f_diarias.csv')
df_inv = pd.read_csv('f_inventario_diario.csv')

# Fazendo o merge pelas 3 colunas em comum
df_dia_e_inv = pd.merge(
    df_dia,
    df_inv,
    on=['hotel_id', 'data_id', 'tipo_quarto'],
    how='inner'  # tipo de junção
)

df_dia_e_inv

,hotel_id,data_id,tipo_quarto,quartos_vendidos,adr_estimado,receita_diarias,quartos_total,quartos_manutencao,quartos_disponiveis
0,1,20240101,Standard,37,367.51,13597.84,55,2,53
1,1,20240102,Standard,39,424.36,16549.95,55,2,53
2,1,20240103,Standard,32,350.25,11207.86,55,0,55
3,1,20240104,Standard,35,309.44,10830.30,55,1,54
4,1,20240105,Standard,54,332.37,17948.08,55,0,55
...,...,...,...,...,...,...,...,...,...
21925,6,20251227,Familia,14,763.34,10686.69,20,0,20
21926,6,20251228,Familia,16,709.42,11350.74,20,0,20
21927,6,20251229,Familia,14,644.95,9029.31,20,1,19
21928,6,20251230,Familia,13,869.08,11298.06,20,1,19
21929,6,20251231,Familia,14,748.11,10473.53,20,1,19

In [53]:
#2. Tratar as diárias e calcular se existe overbooking

#Preciso que o número de quartos disponíveis no hotal seja maior o igual ao número de quartos vendidos para que não acha overbooking

df_total = df_dia_e_inv['quartos_disponiveis'] >= df_dia_e_inv['quartos_vendidos']

df_total

0        True
1        True
2        True
3        True
4        True
         ...
21925    True
21926    True
21927    True
21928    True
21929    True
Length: 21930, dtype: bool

In [54]:
(df_dia_e_inv['quartos_disponiveis'] >= df_dia_e_inv['quartos_vendidos']).all()

np.False_

In [55]:
#Ver os resultados falsos para achar os overbookings:


df_overbooking = df_dia_e_inv[df_dia_e_inv['quartos_disponiveis'] < df_dia_e_inv['quartos_vendidos']]

df_overbooking

,hotel_id,data_id,tipo_quarto,quartos_vendidos,adr_estimado,receita_diarias,quartos_total,quartos_manutencao,quartos_disponiveis
6230,2,20250117,Suite,11,822.28,9045.11,10,0,10
10939,3,20251206,Familia,11,579.32,6372.51,10,0,10
13250,4,20240402,Suite,10,657.86,6578.61,10,1,9
13856,4,20251129,Suite,11,795.07,8745.74,10,0,10
13962,4,20240314,Familia,17,519.29,8827.86,16,0,16
16818,5,20240106,Suite,10,838.35,8383.52,7,0,7
17182,5,20250104,Suite,8,959.70,7677.60,7,0,7
17407,5,20250817,Suite,8,580.19,4641.52,7,0,7
21383,6,20240703,Familia,21,641.21,13465.47,20,1,19

In [58]:
#3. Devolver tabela tratada sem overbooking

df_trat = df_dia_e_inv[df_dia_e_inv['quartos_disponiveis'] >= df_dia_e_inv['quartos_vendidos']].reset_index(drop=True)

df_trat

,hotel_id,data_id,tipo_quarto,quartos_vendidos,adr_estimado,receita_diarias,quartos_total,quartos_manutencao,quartos_disponiveis
0,1,20240101,Standard,37,367.51,13597.84,55,2,53
1,1,20240102,Standard,39,424.36,16549.95,55,2,53
2,1,20240103,Standard,32,350.25,11207.86,55,0,55
3,1,20240104,Standard,35,309.44,10830.30,55,1,54
4,1,20240105,Standard,54,332.37,17948.08,55,0,55
...,...,...,...,...,...,...,...,...,...
21916,6,20251227,Familia,14,763.34,10686.69,20,0,20
21917,6,20251228,Familia,16,709.42,11350.74,20,0,20
21918,6,20251229,Familia,14,644.95,9029.31,20,1,19
21919,6,20251230,Familia,13,869.08,11298.06,20,1,19
21920,6,20251231,Familia,14,748.11,10473.53,20,1,19

In [59]:
df_overbooking.to_csv("Overbooking.csv", sep=';', index=False)
df_overbooking

,hotel_id,data_id,tipo_quarto,quartos_vendidos,adr_estimado,receita_diarias,quartos_total,quartos_manutencao,quartos_disponiveis
6230,2,20250117,Suite,11,822.28,9045.11,10,0,10
10939,3,20251206,Familia,11,579.32,6372.51,10,0,10
13250,4,20240402,Suite,10,657.86,6578.61,10,1,9
13856,4,20251129,Suite,11,795.07,8745.74,10,0,10
13962,4,20240314,Familia,17,519.29,8827.86,16,0,16
16818,5,20240106,Suite,10,838.35,8383.52,7,0,7
17182,5,20250104,Suite,8,959.70,7677.60,7,0,7
17407,5,20250817,Suite,8,580.19,4641.52,7,0,7
21383,6,20240703,Familia,21,641.21,13465.47,20,1,19

In [60]:
df_trat.to_csv("f_diarias_e_inventario_trat.csv", sep=';', index=False)
df_trat

,hotel_id,data_id,tipo_quarto,quartos_vendidos,adr_estimado,receita_diarias,quartos_total,quartos_manutencao,quartos_disponiveis
0,1,20240101,Standard,37,367.51,13597.84,55,2,53
1,1,20240102,Standard,39,424.36,16549.95,55,2,53
2,1,20240103,Standard,32,350.25,11207.86,55,0,55
3,1,20240104,Standard,35,309.44,10830.30,55,1,54
4,1,20240105,Standard,54,332.37,17948.08,55,0,55
...,...,...,...,...,...,...,...,...,...
21916,6,20251227,Familia,14,763.34,10686.69,20,0,20
21917,6,20251228,Familia,16,709.42,11350.74,20,0,20
21918,6,20251229,Familia,14,644.95,9029.31,20,1,19
21919,6,20251230,Familia,13,869.08,11298.06,20,1,19
21920,6,20251231,Familia,14,748.11,10473.53,20,1,19